from IPython.display import display, IFrame

# Теоретичні відомості

Ось приклад вбудованого коду на С. Зверніть увагу на прихований блок з імпортом вище — він не буде відображений на кінцевій сторінці. Відкрийте панель з гаєчним ключем зліва при редагуванні цього нотатника і подивіться на метаданні клітинки (Advanced Tools -> Cell Metadata).

Зверніть також увагу на метаданні клітини з убудованим фреймом.

Текст програми нижче — не інтерактивний. Нажаль, він необхідний для нормального відображення на надрукованих сторінках. Якщо маєте ідеї відносно кращого відображення, кажіть.

```C
#include <stdio.h>

int main(void) 
{
  double a[100];
  int n, i;
  printf("Уведіть кількість чисел n =");
  scanf("%d", &n);
  if(n > (sizeof a) / sizeof(double))
  {
    printf("Забагато елементів\n");
    return 0;
  }
  for(i = 0; i < n; i++)
  {
    printf("a[%d] = ", i);
    scanf("%lf", &a[i]);
  }
  for (i = 0; i < n; ++i)
  {
    printf("%f\n", a[i]);
  }  
}
```

display(IFrame("https://repl.it/repls/AwkwardMarriedParser?lite=true", width="100%", height=600))